performance-test-results/wrk_customers_500_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/customers
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.65ms   36.00ms 346.88ms   88.45%
    Req/Sec     6.58k     1.14k    8.99k    75.25%
  Latency Distribution
     50%   15.44ms
     75%   32.52ms
     90%   72.28ms
     99%  175.87ms
  786296 requests in 30.02s, 386.84MB read
  Non-2xx or 3xx responses: 786296
Requests/sec:  26194.98
Transfer/sec:     12.89MB