performance-test-results/wrk_customers_50_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/customers
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.76ms    4.30ms  80.21ms   90.19%
    Req/Sec     4.01k   663.84     5.44k    82.63%
  Latency Distribution
     50%    2.50ms
     75%    4.95ms
     90%    7.99ms
     99%   20.38ms
  480200 requests in 30.10s, 236.25MB read
  Non-2xx or 3xx responses: 480200
Requests/sec:  15951.57
Transfer/sec:      7.85MB