performance-test-results/wrk_services_10_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/services
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms    1.94ms  58.09ms   98.06%
    Req/Sec     1.82k   268.26     2.16k    86.92%
  Latency Distribution
     50%    1.01ms
     75%    1.23ms
     90%    1.81ms
     99%    5.39ms
  217973 requests in 30.02s, 107.03MB read
  Non-2xx or 3xx responses: 217973
Requests/sec:   7260.15
Transfer/sec:      3.56MB