performance-test-results/wrk_services_200_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/services
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.04ms   15.03ms 186.74ms   89.08%
    Req/Sec     6.05k     0.94k    8.15k    77.75%
  Latency Distribution
     50%    6.61ms
     75%   14.56ms
     90%   28.62ms
     99%   75.83ms
  722794 requests in 30.01s, 354.91MB read
  Non-2xx or 3xx responses: 722794
Requests/sec:  24084.45
Transfer/sec:     11.83MB