performance-test-results/wrk_services_50_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/services
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.83ms    4.73ms  86.11ms   91.36%
    Req/Sec     4.01k   569.35     5.11k    81.50%
  Latency Distribution
     50%    2.49ms
     75%    5.03ms
     90%    8.03ms
     99%   21.75ms
  479355 requests in 30.01s, 235.38MB read
  Non-2xx or 3xx responses: 479355
Requests/sec:  15973.17
Transfer/sec:      7.84MB