performance-test-results/wrk_staff_10_20250819_231936.txt
Running 30s test @ http://localhost:8085/api/staff
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms    1.14ms  30.99ms   96.84%
    Req/Sec     1.87k   258.16     2.23k    88.75%
  Latency Distribution
     50%    1.01ms
     75%    1.21ms
     90%    1.68ms
     99%    3.82ms
  223067 requests in 30.01s, 108.89MB read
  Non-2xx or 3xx responses: 223067
Requests/sec:   7431.97
Transfer/sec:      3.63MB